[
{"name": "Grasscity The Weezy Jack-Pod Smoking Pipe", "price": "\n                    €22.68                ", "sales_price": "\n                        €18.14                    ", "images": "https://www.grasscity.eu/media/catalog/product/cache/5/image/9df78eab33525d08d6e5fb8d27136e95/1/h/1h02-0s1-gs-_05_.jpg , https://www.grasscity.eu/media/catalog/product/cache/5/image/9df78eab33525d08d6e5fb8d27136e95/1/h/1h02-0s1-gs-_04_.jpg , https://www.grasscity.eu/media/catalog/product/cache/5/image/9df78eab33525d08d6e5fb8d27136e95/1/h/1h02-0s1-gs-_02_.jpg , https://www.grasscity.eu/media/catalog/product/cache/5/image/9df78eab33525d08d6e5fb8d27136e95/1/h/1h02-0s1-gs-_03_.jpg , https://www.grasscity.eu/media/catalog/product/cache/5/image/9df78eab33525d08d6e5fb8d27136e95/1/h/1h02-0s1-gs-_01_.jpg", "description": "<div class=\"block-content std\">\n            <h4>Grasscity The Weezy Jack-Pod Smoking Pipe</h4>\r\n<p>Get ready for a revolutionary new way of smoking that is taking over the market by a storm with the Weezy. The Weezy is the first available cone-shaped one-hitter pipe on the market that works with an inventive pod-system called Jack-Pods. The Jack-Pods are small reusable pods that are completely recyclable and can carry up to 0.2 grams of your favorite herbs.</p>\r\n<p>The Weezy works with refillable Jack-Pods that can be pre-filled, so you always have them ready, which makes it perfect for having a few quick hits when you are out and about. The refillable Jack-Pods can be used around 100 times and can easily be filled over and over again. The Weezy come in an airtight, smell proof storage container that pops open by squeezing the top of the container on both sides simultaneously.</p>\r\n<p>To use, unscrew the top of the Weezy to get access to the Jack-Pod. Unscrew and fill up your Jack-Pod before placing your filled Jack-Pod back into the pipe. Ones you have reassembled the device all you have to do is fire it up. After having about two or three tokes, flip over your Jack-Pod for another few hits. </p>\r\n<p>The Weezy offers an easier and cleaner smoking experience than any other regular pipes due to the replaceable active carbon filter that is placed in the mouthpiece. It filters most tar, ash and other unwanted components out of the smoke, for a cleaner, smoother and tastier smoking experience.</p>\r\n        </div>", "categories": "Grasscity Headshop", "brand": "Grasscity"}
]